# GetParentHwnd Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionsOnSheetUIServiceData..::..GetParentHwnd Method
RevisionsOnSheetUIServiceData Class See Also
---
return the parent handle
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IntPtr GetParentHwnd()
```

Visual Basic
---
```text
Public Function GetParentHwnd As IntPtr
```

Visual C++
---
```text
public:
IntPtr GetParentHwnd()
```

# See Also
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace